src/rails-workspace/toy-app/toy-app/app/controllers/users_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def show
    @micropost = Micropost.where(user_id: params[:id]).first